{"body": [{"indent": 0, "text": ["Volume Rendering - File Referenced Smoke"], "type": "title", "level": 0}, {"indent": 0, "type": "para", "text": ["Volume rendering is a rendering approach that allows high-quality, integrated rendering of volumetric effects like smoke, clouds, spray, and fire."]}, {"indent": 0, "type": "para", "text": ["Volume rendering is suitable for rendering many types of volumetric effects. Scenes that are particularly suited to rendering with mantra volumes include:"]}, {"body": [{"indent": 0, "blevel": 2, "type": "bullet", "text": ["Detailed \"hero\" clouds, smoke, or fire"]}, {"indent": 0, "blevel": 2, "type": "bullet", "text": ["Fields of instanced clouds, smoke, or fire"]}], "container": true, "type": "bullet_group"}, {"indent": 0, "type": "para", "text": ["Scenes where volume rendering may not be quite so applicable include:"]}, {"body": [{"indent": 0, "blevel": 2, "type": "bullet", "text": ["Scenes with a single uniform fog"]}], "container": true, "type": "bullet_group"}, {"indent": 0, "type": "para", "text": ["In this particular example, a bgeo file (1 frame only) was exported from a fluid simulation of smoke and is now referenced using the File SOP. A material using VEX Volume Cloud is assigned to this volumetric data at the top level of the Volume Object. To see this scene in shaded mode, ensure that HOUDINI_OGL_ENABLE_SHADERS is set to 1 in the environment variables. "]}, {"body": [{"indent": 0, "type": "para", "text": ["Volume rendering uses ray marching to step through volumes. Ray marching generates shading points in the volume by uniformly stepping along rays for each pixel in the image. There are two ways to change the quality and speed of the volume ray marching:"]}, {"body": [{"indent": 0, "blevel": 2, "type": "ord", "text": ["The samples parameter on the Sampling tab of the mantra ROP. More pixel samples will produce more ray marches within that pixel leading to higher quality. Using more pixel samples will also improve antialiasing and motion blur quality for the volume."]}, {"indent": 0, "blevel": 2, "type": "ord", "text": ["The volumequality parameter on the Sampling tab of the mantra ROP. A larger volume quality will produce more samples in the volume interior, improving quality and decreasing performance. A separate shadow quality can be used for shadows."]}], "container": true, "type": "ord_group"}, {"indent": 0, "type": "para", "text": ["Which parameter you should change will depend on your quality requirements for pixel antialiasing. In general, it is better to decrease the volume step size rather than increase the pixel samples because a smaller volume step size will lead to more accurate renders."]}, {"indent": 0, "type": "para", "text": ["This render uses 2×2 samples and volume quality of 1. Notice the detail in the shadows."]}, {"indent": 0, "type": "para", "text": [{"_hs_sc": true, "text": "", "value": "/examples/nodes/out/ifd/volume_smoke1.jpg", "fullpath": "/examples/nodes/out/ifd/volume_smoke1.jpg", "scheme": "Image", "type": "link"}]}, {"indent": 0, "type": "para", "text": ["This render uses the same scene with 4×4 samples and a volume quality of 0.25. The fine detail in the shadow has been lost and the volume is somewhat more transparent. The quality level is approximately the same."]}, {"indent": 0, "type": "para", "text": [{"_hs_sc": true, "text": "", "value": "/examples/nodes/out/ifd/volume_smoke2.jpg", "fullpath": "/examples/nodes/out/ifd/volume_smoke2.jpg", "scheme": "Image", "type": "link"}]}], "indent": 0, "level": 2, "text": ["Controlling Quality/Performance"], "container": true, "type": "h", "id": null}], "title": ["Volume Rendering - File Referenced Smoke"], "examplefile": "/examples/nodes/out/ifd/volume_smoke.otl", "attrs": {"exampleFile": "volume_smoke.otl", "type": "example"}, "type": "root", "examplefor": "/nodes/out/ifd"}